Revit 2027 API
SteelElementProperties.UniqueID Property
 This method will return the fabrication id. This represents the link between the Revit and the Steel Core element.
Namespace: Autodesk.Revit.DB.Steel
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Guid UniqueID { get; }
Public ReadOnly Property UniqueID As Guid
	Get
public:
property Guid UniqueID {
	Guid get ();
}
member UniqueID : Guid with get
Property Value
Guid
Remarks
 This id should not be confused with the guid returned by ExportUtils.GetExportId().
See Also
Reference
SteelElementProperties Class
Autodesk.Revit.DB.Steel Namespace